README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-25 dim. 17:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>FUNX Python Abstract Machine  and Compilers</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="jmc" />
<meta name="description" content="Information on a tentative Python implementation of FUNX"
 />
<meta name="keywords" content="FUNX, FUNXP, Nexpert, Functional Programming, Python" />

<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>





</head>
<body>
<div id="content">
<h1 class="title">FUNX Python Abstract Machine  and Compilers</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org60ec19c">1. A Python-based FUNX Abstract Machine</a></li>
<li><a href="#org47ef32e">2. Design Notes</a>
<ul>
<li><a href="#org6a9a901">2.1. Memory management: cells and lists</a></li>
<li><a href="#org01d0229">2.2. Garbage collection</a></li>
<li><a href="#org3e76307">2.3. Parser</a></li>
<li><a href="#org318c0f0">2.4. Abstract Machine</a></li>
</ul>
</li>
<li><a href="#orge203db6">3. A Metacircular FUNX Compiler</a></li>
<li><a href="#org40c6439">4. A Native FUNX Compiler</a></li>
</ul>
</div>
</div>


<div id="outline-container-org60ec19c" class="outline-2">
<h2 id="org60ec19c"><span class="section-number-2">1</span> A Python-based FUNX Abstract Machine</h2>
<div class="outline-text-2" id="text-1">
<p>
The SECD Machine Python implementation is invoked from the command line with <code>secd_run.py</code>.
</p>

<pre class="example">
(venv) SECD&gt;python secd_run.py --help
usage: secd_run.py [-h] [--log LOG] [--env ENV] [--verbose]
                   [--outfile OUTFILE]
                   [infile]

funx VM. (c) jmc 2021.

positional arguments:
  infile             SECD source file

optional arguments:
  -h, --help         show this help message and exit
  --log LOG          logfile (optional)
  --env ENV          global environment (optional)
  --verbose
  --outfile OUTFILE  result of execution (optional)
</pre>

<p>
Its input file is the control list for the program, usually the result of the compilation of the <code>funx</code> source code.
</p>

<p>
For instance, invoking:
</p>

<pre class="example">
(venv) SECD&gt;python secd_run.py example3.secd
(6)
</pre>

<p>
returns the stack when execution terminates.
</p>

<p>
In this example, the control list <code>example3.secd</code>:
</p>
<pre class="example">
(DUM LDF ((n) LDC 1 LD n EQ SEL (LDC 1 JOIN) (LD n LDC 1 SUB LD fac AP LD n MUL JOIN) RTN) LDF ((fac) LDC 3 LD fac AP RTN) RAP STOP)
</pre>

<p>
is the result of the compilation of the <code>funx</code> source code for the famous factorial function in <code>example3.funx</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #4f97d7; font-weight: bold;">let</span> ((fac (<span style="color: #4f97d7; font-weight: bold;">lambda</span> (n)
             (<span style="color: #4f97d7; font-weight: bold;">if</span> (eq n (<span style="color: #4f97d7; font-weight: bold;">quote</span> 1)) (<span style="color: #4f97d7; font-weight: bold;">quote</span> 1)
               (mul n (fac (sub (<span style="color: #4f97d7; font-weight: bold;">quote</span> 1) n)))))))
  (fac (<span style="color: #4f97d7; font-weight: bold;">quote</span> 3)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org47ef32e" class="outline-2">
<h2 id="org47ef32e"><span class="section-number-2">2</span> Design Notes</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6a9a901" class="outline-3">
<h3 id="org6a9a901"><span class="section-number-3">2.1</span> Memory management: cells and lists</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The new issue brought forward by the Python implementation is of course an old problem of any Lisp implementation: memory management for cells and lists. (See abundant bibliography dating back to the sixties.) In this experimental endeavor we opted for simplicity, possibly at the cost of performance.
</p>

<p>
Each cell is a two-pointer block, aptly named the <code>car</code> and <code>cdr</code> pointers. Each pointer is a 16-bit integer index in a global Python array (<code>g_mem</code>) when positive, and if negative a 16-bit integer index (with sign reversed) in another global Python array, the symbol table (<code>g_symtable</code>), which stores all values and symbol regardless of type with possible redundancy. The symbol <code>NIL</code> is the unique cell with both pointers set to <code>0</code>.
</p>

<p>
Over this simplistic data schema, the <code>secd_mem.py</code> memory manager provides primitives to create, modify, link and delete cells in global memory. It also provides simple search functions in the symbol table.
</p>

<p>
Initially all cells are unallocated with both pointers to <code>0</code>. The memory manager keeps the index of the last allocated cell. Note that as the cells get allocated by the running program, this index increases until it hits the maximum size of the memory array and a <code>memory full</code> error is reported. (Even though some of the cells beneath the last-allocated index have been released in the mean time: this is the subject of garbage collection in the next section.)
</p>

<p>
An alternate function is provided which uses for a new cell the first empty cell found (both pointers <code>0</code>) starting from the first cell, each time. Execution time is then longer (in average) as a linear search is performed before each new allocation.
</p>

<p>
Lists are built by "consing" a <code>car</code> pointing either to memory or the symbol table, according to its sign, to a <code>cdr</code> pointing to memory for the tail of the list.
</p>

<p>
A few symbols are initialized up front, <code>NIL</code> is required to sit at index <code>0</code> in the symbol table.
</p>

<pre class="example">
NIL	= secd_sym_get_create('nil') # Has to be equal to 0
NOP	= NIL
TRUE	= -secd_sym_get_create('True')
FALSE	= -secd_sym_get_create('False')
KW_REST	= -secd_sym_get_create('&amp;rest')
KW_SKP	= -secd_sym_get_create('&amp;skp')
</pre>
</div>
</div>

<div id="outline-container-org01d0229" class="outline-3">
<h3 id="org01d0229"><span class="section-number-3">2.2</span> Garbage collection</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The garbage collector in this simple implementation is from Henderson's book. Starting from the cells representing the <code>S</code>, <code>E</code>, <code>C</code> and <code>D</code> registers of the abstract machine it marks, all cells by following both pointers.
</p>

<p>
In a second steps all marked cells are released, i.e. both of their pointers are set back to <code>0</code>.
</p>
</div>
</div>

<div id="outline-container-org3e76307" class="outline-3">
<h3 id="org3e76307"><span class="section-number-3">2.3</span> Parser</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The parser provides function to translate lists from memory to printable expressions and back.
</p>

<p>
It also (experimentally) provides a translation from memory cells to <code>dot</code> graph representations.
</p>
</div>
</div>

<div id="outline-container-org318c0f0" class="outline-3">
<h3 id="org318c0f0"><span class="section-number-3">2.4</span> Abstract Machine</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The abstract machine itself is in the <code>secd_am.py</code> file. Each control is implemented by a transition function operating on the memory representation of the registers.
</p>
</div>
</div>
</div>

<div id="outline-container-orge203db6" class="outline-2">
<h2 id="orge203db6"><span class="section-number-2">3</span> A Metacircular FUNX Compiler</h2>
<div class="outline-text-2" id="text-3">
<p>
As an initial bootstrapping step, a metacircular compiler was created, based on the above Abstract Machine. (See <code>secd_comp.py</code>.) The metacircular compiler expects one additional argument to the input and output file, namely the control list of the <code>funx</code> compiler itself.
</p>

<pre class="example">
(venv) SECD&gt;python secd_comp.py --help
usage: secd_comp.py [-h] [--log LOG] [--verbose] [--alternate ALTERNATE]
                    infile [outfile]

funx Metacircular Strict Compiler. (c) jmc 2021.

positional arguments:
  infile                funx source file
  outfile               secd compiled file

optional arguments:
  -h, --help            show this help message and exit
  --log LOG             logfile (optional)
  --verbose
  --alternate ALTERNATE
                        alternate compiler secd-file
</pre>

<p>
The bootstrap file  (<code>compiler.secd</code>) was obtained by running the Emacs-based <code>funx</code> compiler on the <code>funx</code> source (<code>compiler.funx</code>) of the compiler itself. The compiler control list can be replaced, however, with the <code>--alternate</code> parameter in the above invocation.
</p>

<p>
This is a traditional way to explore alternative constructs in the language and extend the compiler.
</p>

<div class="NOTE">
<p>
Note:
The <code>funx</code> source for the compiler defines the <code>sedcomp</code> function and evaluates the statement: <code>(sedcomp (quote "%s") nil nil)</code>. Although <code>"%s"</code> is not a legal variable name in <code>funx</code>, its purpose here is simply to be replaced by the actual source to be compiled which then appears, quoted, on top of the stack.
</p>

<p>
The metacircular compiler then substitutes the source code from the input file into the above expression and evaluates it with the Python Abstract Machine.
</p>

</div>

<p>
For instance, using the alternate compiler control list <code>comp4-1.secd</code> for a variant of the language introducing new controls, such as <code>SKP</code>:
</p>

<pre class="example">
(venv) SECD&gt;python secd_comp.py --alternate comp4-1.secd example3.funx
(DUM LDF ((n) LDC 1 LD n EQ SEL (LDC 1 JOIN) (SKP LD n LDC 1 SUB LD fac AP LD n MUL JOIN) RTN) LDF
((fac) SKP LDC 6 LD fac AP RTN) RAP STOP)
</pre>

<div class="NOTE">
<p>
Note:
The <code>comp4-1.secd</code> control list for the variant compiler was itseld obtained by running the metacircular compiler on the source code of the variant compiler in <code>comp4-1.txt</code>.
</p>

</div>
</div>
</div>

<div id="outline-container-org40c6439" class="outline-2">
<h2 id="org40c6439"><span class="section-number-2">4</span> A Native FUNX Compiler</h2>
<div class="outline-text-2" id="text-4">
<p>
A native strict compiler is provided as <code>secd_pycomp.py</code>, which is faster than the metacircular compiler as it relies on the underlying Python implementation for memory allocation.
</p>

<pre class="example">
(venv) SECD&gt;python secd_pycomp.py --help
usage: secd_pycomp.py [-h] [--log LOG] [--verbose] infile [outfile]

funx Python Strict Compiler. (c) jmc 2021.

positional arguments:
  infile      funx source file
  outfile     secd compiled file

optional arguments:
  -h, --help  show this help message and exit
  --log LOG   logfile (optional)
  --verbose
</pre>

<p>
So that, going back to the original factorial example above applied on 6 rather than on 3, invoking:
</p>

<pre class="example">
(venv) SECD&gt;python secd_pycomp.py example3.funx
(DUM LDF ((n) LDC 1 LD n EQ SEL (LDC 1 JOIN) (SKP LD n LDC 1 SUB LD fac AP LD n MUL JOIN) RTN) LDF ((fac) SKP LDC 6 LD fac AP RTN) RAP STOP)
</pre>

<p>
directly produces a control list which can be filed or consumed by the abstract machine. (Note the use of the <code>SKP</code> control to delimitate the list of arguments to a function call, a variant from the canonical <code>funx</code> specification.)
</p>

<p>
Therefore the piped invocation:
</p>

<pre class="example">
(venv) SECD&gt;python secd_pycomp.py example3.funx | python secd_run.py
(720)
</pre>

<p>
directly produces the expected result 720, as the top of the SECD Absract Machine stack.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jmc</p>
<p class="date">Created: 2021-07-25 dim. 17:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
